PicoGit/dsPIC33AKxxMCxxx/RemapPin_Driver.c
/*----------------------------------------------------------------------------*/
/**
* @file		RemapPin_Driver.c
* @brief	リマッパブルピンに関するドライバ関数
* @date		24/07/16
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "remappin_user.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_RemapPin_Set_Input_Register(void) 
* @brief        リマッパブル入力ピンのレジスタをセットします 
* @param
* @return
* @detail
*/
/*----------------------------------------------------------------------------*/
void vdg_RemapPin_Set_Input_Register(void)
{
	/*-----------------------------------------------------------------------*/
	/* RPCONレジスタ */
	/*-----------------------------------------------------------------------*/
		RPCON = 0x00000000u;
		#ifdef DEF_BITNAME
			RPCONbits.IOLOCK = 0u;
		#endif 


    /*-----------------------------------------------------------------------*/
	/* RPINR0レジスタ */
	/*-----------------------------------------------------------------------*/     
        RPINR0	= ( RPI_USER_INT1 << 8u) |		/* INT1入力ピン選択ビット */
				  ( RPI_USER_INT2 << 16u) |     /* INT2入力ピン選択ビット */
                  ( RPI_USER_INT3 << 24u);      /* INT3入力ピン選択ビット */
    /*-----------------------------------------------------------------------*/
	/* RPINR1レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR1 = ( RPI_USER_INT4 << 0u) |		/* INT4入力ピン選択ビット */
				 ( RPI_USER_T1CK << 8u) |		/* T1CK入力ピン選択ビット */
				 ( RPI_USER_REFI1 << 16u) |     /* REFI1入力ピン選択ビット */
                 ( RPI_USER_REFI2 << 24u);      /* REFI2入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR2レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR2 = ( RPI_USER_ICM1 << 0u) |		/* ICM1入力ピン選択ビット */
				 ( RPI_USER_ICM2 << 8u) |		/* ICM2入力ピン選択ビット */
				 ( RPI_USER_ICM3 << 16u) |      /* ICM3入力ピン選択ビット */
                 ( RPI_USER_ICM4 << 24u);       /* ICM4入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR5レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR5 = ( RPI_USER_OCFA << 0u) |		/* OCFA入力ピン選択ビット */
				 ( RPI_USER_OCFB << 8u) |		/* OCFB入力ピン選択ビット */
				 ( RPI_USER_OCFC << 16u) |      /* OCFC入力ピン選択ビット */
                 ( RPI_USER_OCFD << 24u);       /* OCFD入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR6レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR6 = ( RPI_USER_PCI8 << 0u) |		/* PCI8入力ピン選択ビット */
				 ( RPI_USER_PCI9 << 8u) |		/* PCI9入力ピン選択ビット */
				 ( RPI_USER_PCI10 << 16u) |     /* PCI10入力ピン選択ビット */
                 ( RPI_USER_PCI11 << 24u);      /* PCI11入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR7レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR7 = ( RPI_USER_QEIA1 << 0u) |		/* QEIA1入力ピン選択ビット */
				 ( RPI_USER_QEIB1 << 8u) |		/* QEIB1入力ピン選択ビット */
				 ( RPI_USER_QEIINDX1 << 16u) |     /* QEIINDX1入力ピン選択ビット */
                 ( RPI_USER_QEIHOME1 << 24u);      /* QEIHOME1入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR9レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR9 = ( RPI_USER_U1RX << 0u) |		/* U1RX入力ピン選択ビット */
				 ( RPI_USER_U1DSR << 8u) |		/* U1DSR入力ピン選択ビット */
				 ( RPI_USER_U2RX << 16u) |      /* U2RX1入力ピン選択ビット */
                 ( RPI_USER_U2DSR << 24u);      /* U2DSR入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR10レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR10 = ( RPI_USER_SDI1 << 0u) |		/* SDI1入力ピン選択ビット */
				 ( RPI_USER_SCK1 << 8u) |		/* SCK1入力ピン選択ビット */
				 ( RPI_USER_SS1 << 16u) ;       /* SS1入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR11レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR11 = ( RPI_USER_SDI2 << 0u) |		/* SDI2入力ピン選択ビット */
				 ( RPI_USER_SCK2 << 8u) |		/* SCK2入力ピン選択ビット */
				 ( RPI_USER_SS2 << 16u) ;       /* SS2入力ピン選択ビット */
		

	/*-----------------------------------------------------------------------*/
	/* RPINR13レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR13 = ( RPI_USER_U3RX << 0u) |		/* U3RX入力ピン選択ビット */
				 ( RPI_USER_U3DSR << 8u) ;		/* U3DSR入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPINR14レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR14 = ( RPI_USER_SENT1 << 16u) |     /* SENT1入力ピン選択ビット */
                 ( RPI_USER_SENT2 << 24u);      /* SENT2入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPINR15レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR15 = ( RPI_USER_SDI3 << 0u) |		/* SDI3入力ピン選択ビット */
				 ( RPI_USER_SCK3 << 8u) |		/* SCK3入力ピン選択ビット */
				 ( RPI_USER_SS3 << 16u) ;       /* SS3入力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPINR17レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR17 = ( RPI_USER_PCI12 << 0u) |		/* PCI12入力ピン選択ビット */
				 ( RPI_USER_PCI13 << 8u) |		/* PCI13入力ピン選択ビット */
				 ( RPI_USER_PCI14 << 16u) |     /* PCI14入力ピン選択ビット */
				 ( RPI_USER_PCI15 << 24u);      /* PCI15入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPINR18レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR18 = ( RPI_USER_PCI16 << 0u) |		/* PCI16入力ピン選択ビット */
				 ( RPI_USER_PCI17 << 8u) |		/* PCI17入力ピン選択ビット */
				 ( RPI_USER_PCI18 << 16u) |     /* PCI18入力ピン選択ビット */
				 ( RPI_USER_ADTRIG31 << 24u);   /* ADTRIG31入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPINR19レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR19 = ( RPI_USER_BISS1SL << 0u) |    /* BISS1SL入力ピン選択ビット */
                 ( RPI_USER_BISS1GS << 8u);      /* SENT2入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPINR20レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR20 = ( RPI_USER_CLCINA << 0u) |	/* CLCINA入力ピン選択ビット */
				 ( RPI_USER_CLCINB << 8u) |		/* CLCINB入力ピン選択ビット */
				 ( RPI_USER_CLCINC << 16u) |    /* CLCINC入力ピン選択ビット */
				 ( RPI_USER_CLCIND << 24u);     /* CLCIND入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPINR21レジスタ */
	/*-----------------------------------------------------------------------*/
		RPINR21 =  ( RPI_USER_U1CTS << 0u) |	/* U1CTS入力ピン選択ビット */
				 ( RPI_USER_U2CTS << 8u) |		/* U2CTS入力ピン選択ビット */
				 ( RPI_USER_U3CTS << 16u) ;    /* U3CTS入力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR0レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR0 = ( RPO_USER_RP1R << 0u) |		/* RP1出力ピン選択ビット */
				 ( RPO_USER_RP2R << 8u) |		/* RP2出力ピン選択ビット */
				 ( RPO_USER_RP3R << 16u) |      /* RP3出力ピン選択ビット */
				 ( RPO_USER_RP4R << 24u);       /* RP4出力ピン選択ビット */

	
}
/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_RemapPin_Set_Output_Register(void) 
* @brief        リマッパブル出力ピンのレジスタをセットします 
* @param
* @return
* @detail
*/
/*----------------------------------------------------------------------------*/
void vdg_RemapPin_Set_Output_Register(void)
{
    /*-----------------------------------------------------------------------*/
	/* RPOR1レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR1 = ( RPO_USER_RP5R << 0u) |		/* RP5出力ピン選択ビット */
				 ( RPO_USER_RP6R << 8u) |		/* RP6出力ピン選択ビット */
				 ( RPO_USER_RP7R << 16u) |      /* RP7出力ピン選択ビット */
				 ( RPO_USER_RP8R << 24u);       /* RP8出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR2レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR2 = ( RPO_USER_RP9R << 0u) |		/* RP9出力ピン選択ビット */
				 ( RPO_USER_RP10R << 8u) |		/* RP10出力ピン選択ビット */
				 ( RPO_USER_RP11R << 16u) |      /* RP11出力ピン選択ビット */
				 ( RPO_USER_RP12R << 24u);       /* RP12出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR4レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR4 = ( RPO_USER_RP17R << 0u) |		/* RP17出力ピン選択ビット */
				 ( RPO_USER_RP18R << 8u) |		/* RP18出力ピン選択ビット */
				 ( RPO_USER_RP19R << 16u) |      /* RP19出力ピン選択ビット */
				 ( RPO_USER_RP20R << 24u);       /* RP20出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR5レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR5 = ( RPO_USER_RP21R << 0u) |		/* RP21出力ピン選択ビット */
				 ( RPO_USER_RP22R << 8u) |		/* RP22出力ピン選択ビット */
				 ( RPO_USER_RP23R << 16u) |     /* RP23出力ピン選択ビット */
				 ( RPO_USER_RP24R << 24u);      /* RP24出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR6レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR6 = ( RPO_USER_RP25R << 0u) |		/* RP25出力ピン選択ビット */
				 ( RPO_USER_RP26R << 8u) |		/* RP26出力ピン選択ビット */
				 ( RPO_USER_RP27R << 16u) |     /* RP27出力ピン選択ビット */
				 ( RPO_USER_RP28R << 24u);      /* RP28出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR8レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR8 = ( RPO_USER_RP33R << 0u) |		/* RP33出力ピン選択ビット */
				 ( RPO_USER_RP34R << 8u) |		/* RP34出力ピン選択ビット */
				 ( RPO_USER_RP35R << 16u) |     /* RP35出力ピン選択ビット */
				 ( RPO_USER_RP36R << 24u);      /* RP36出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR9レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR9 = ( RPO_USER_RP37R << 0u) |		/* RP37出力ピン選択ビット */
				 ( RPO_USER_RP38R << 8u) |		/* RP38出力ピン選択ビット */
				 ( RPO_USER_RP39R << 16u) |     /* RP39出力ピン選択ビット */
				 ( RPO_USER_RP40R << 24u);      /* RP40出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR10レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR10 = ( RPO_USER_RP41R << 0u) |		/* RP41出力ピン選択ビット */
				 ( RPO_USER_RP42R << 8u) |		/* RP42出力ピン選択ビット */
				 ( RPO_USER_RP43R << 16u) |     /* RP43出力ピン選択ビット */
				 ( RPO_USER_RP44R << 24u);      /* RP44出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR12レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR12 = ( RPO_USER_RP49R << 0u) |		/* RP49出力ピン選択ビット */
				 ( RPO_USER_RP50R << 8u) |		/* RP50出力ピン選択ビット */
				 ( RPO_USER_RP51R << 16u) |     /* RP51出力ピン選択ビット */
				 ( RPO_USER_RP52R << 24u);      /* RP52出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR13レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR13 = ( RPO_USER_RP53R << 0u) |		/* RP53出力ピン選択ビット */
				 ( RPO_USER_RP54R << 8u) |		/* RP54出力ピン選択ビット */
				 ( RPO_USER_RP55R << 16u) |     /* RP55出力ピン選択ビット */
				 ( RPO_USER_RP56R << 24u);      /* RP56出力ピン選択ビット */


	/*-----------------------------------------------------------------------*/
	/* RPOR14レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR14  = ( RPO_USER_RP57R << 0u) |		/* RP57出力ピン選択ビット */
				 ( RPO_USER_RP58R << 8u) |		/* RP58出力ピン選択ビット */
				 ( RPO_USER_RP59R << 16u) |     /* RP59出力ピン選択ビット */
				 ( RPO_USER_RP60R << 24u);      /* RP60出力ピン選択ビット */ 

	/*-----------------------------------------------------------------------*/
	/* RPOR15レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR15 =  ( RPO_USER_RP61R << 0u) |		/* RP61出力ピン選択ビット */
				 ( RPO_USER_RP62R << 8u) |		/* RP62出力ピン選択ビット */
				 ( RPO_USER_RP63R << 16u) |     /* RP63出力ピン選択ビット */
				 ( RPO_USER_RP64R << 24u);      /* RP64出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR16レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR16 =  ( RPO_USER_RP65R << 0u) |		/* RP65出力ピン選択ビット */
				 ( RPO_USER_RP66R << 8u) |		/* RP66出力ピン選択ビット */
				 ( RPO_USER_RP67R << 16u) |     /* RP67出力ピン選択ビット */
				 ( RPO_USER_RP68R << 24u);      /* RP68出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR17レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR17 =  ( RPO_USER_RP69R << 0u) |		/* RP69出力ピン選択ビット */
				 ( RPO_USER_RP70R << 8u) |		/* RP70出力ピン選択ビット */
				 ( RPO_USER_RP71R << 16u) |     /* RP71出力ピン選択ビット */
				 ( RPO_USER_RP72R << 24u);      /* RP72出力ピン選択ビット */

	/*-----------------------------------------------------------------------*/
	/* RPOR18レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR18 = ( RPO_USER_RP73R << 0u) |		/* RP73出力ピン選択ビット */
				 ( RPO_USER_RP74R << 8u) |		/* RP74出力ピン選択ビット */
				 ( RPO_USER_RP75R << 16u) |     /* RP75出力ピン選択ビット */
				 ( RPO_USER_RP76R << 24u);      /* RP76出力ピン選択ビット */
	/*-----------------------------------------------------------------------*/
	/* RPOR19レジスタ */
	/*-----------------------------------------------------------------------*/
		RPOR19 = ( RPO_USER_RP77R << 0u) |		/* RP77出力ピン選択ビット */
				 ( RPO_USER_RP78R << 8u) |		/* RP78出力ピン選択ビット */
				 ( RPO_USER_RP79R << 16u) |     /* RP79出力ピン選択ビット */
				 ( RPO_USER_RP80R << 24u);      /* RP80出力ピン選択ビット */
}
/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_RemapPin_Set_Register(void) 
* @brief     リマッパブルピンのレジスタをセットします 
* @param
* @return
* @detail
*/
/*----------------------------------------------------------------------------*/
void vdg_RemapPin_Set_All_Register(void)
{
    vdg_RemapPin_Set_Input_Register();
    vdg_RemapPin_Set_Output_Register();
}
